## Plan Result (demo-backendappgateway)




<pre><code>Plan: 0 to add, 6 to change, 0 to destroy.</code></pre>

* Update
  * module.backendappgateway.azurerm_application_gateway.ag[0]
  * module.backendappgateway.azurerm_application_gateway.ag[1]
  * module.backendappgateway.azurerm_monitor_diagnostic_setting.diagnostic_settings[0]
  * module.backendappgateway.azurerm_monitor_diagnostic_setting.diagnostic_settings[1]
  * module.backendappgateway.azurerm_public_ip.app_gw[0]
  * module.backendappgateway.azurerm_public_ip.app_gw[1]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.backendappgateway.data.azurerm_monitor_diagnostic_categories.diagnostic_categories will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_monitor_diagnostic_categories" "diagnostic_categories" {
      + id                  = (known after apply)
      + log_category_groups = (known after apply)
      + log_category_types  = (known after apply)
      + logs                = (known after apply)
      + metrics             = (known after apply)
      + resource_id         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw"

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.backendappgateway.azurerm_application_gateway.ag[0] will be updated in-place
  ~ resource "azurerm_application_gateway" "ag" {
        id                                = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw"
        name                              = "cft-aks00-demo-agw"
        tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "Medium"
            "environment"  = "demo"
        }
        # (7 unchanged attributes hidden)

      - request_routing_rule {
          - http_listener_id            = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/httpListeners/dg-docmosis-redirect" -> null
          - http_listener_name          = "dg-docmosis-redirect" -> null
          - id                          = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/requestRoutingRules/dg-docmosis-redirect" -> null
          - name                        = "dg-docmosis-redirect" -> null
          - priority                    = 780 -> null
          - redirect_configuration_id   = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/redirectConfigurations/dg-docmosis-redirect" -> null
          - redirect_configuration_name = "dg-docmosis-redirect" -> null
          - rule_type                   = "Basic" -> null
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/backendAddressPools/aac-manage-case-assignment" -> null
          - backend_address_pool_name  = "aac-manage-case-assignment" -> null
          - backend_http_settings_id   = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/backendHttpSettingsCollection/aac-manage-case-assignment" -> null
          - backend_http_settings_name = "aac-manage-case-assignment" -> null
          - http_listener_id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/httpListeners/aac-manage-case-assignment" -> null
          - http_listener_name         = "aac-manage-case-assignment" -> null
          - id                         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/requestRoutingRules/aac-manage-case-assignment" -> null
          - name                       = "aac-manage-case-assignment" -> null
          - priority                   = 640 -> null
          - rule_type                  = "Basic" -> null
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/backendAddressPools/am-judicial-booking-service" -> null
          - backend_address_pool_name  = "am-judicial-booking-service" -> null
          - backend_http_settings_id   = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/backendHttpSettingsCollection/am-judicial-booking-service" -> null
          - backend_http_settings_name = "am-judicial-booking-service" -> null
          - http_listener_id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/httpListeners/am-judicial-booking-service" -> null
          - http_listener_name         = "am-judicial-booking-service" -> null
          - id                         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/requestRoutingRules/am-judicial-booking-service" -> null
          - name                       = "am-judicial-booking-service" -> null
          - priority                   = 50 -> null
          - rule_type                  = "Basic" -> null
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/backendAddressPools/am-org-role-mapping-service" -> null
          - backend_address_pool_name  = "am-org-role-mapping-service" -> null
          - backend_http_settings_id   = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/backendHttpSettingsCollection/am-org-role-mapping-service" -> null
          - backend_http_settings_name = "am-org-role-mapping-service" -> null
          - http_listener_id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/httpListeners/am-org-role-mapping-service" -> null
          - http_listener_name         = "am-org-role-mapping-service" -> null
          - id                         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/requestRoutingRules/am-org-role-mapping-service" -> null
          - name                       = "am-org-role-mapping-service" -> null
          - priority                   = 590 -> null
          - rule_type                  = "Basic" -> null
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/backendAddressPools/am-role-assignment-service" -> null
          - backend_address_pool_name  = "am-role-assignment-service" -> null
          - backend_http_settings_id   = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/backendHttpSettingsCollection/am-role-assignment-service" -> null
          - backend_http_settings_name = "am-role-assignment-service" -> null
          - http_listener_id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/httpListeners/am-role-assignment-service" -> null
          - http_listener_name         = "am-role-assignment-service" -> null
          - id                         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/requestRoutingRules/am-role-assignment-service" -> null
          - name                       = "am-role-assignment-service" -> null
          - priority                   = 190 -> null
          - rule_type                  = "Basic" -> null
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/backendAddressPools/bar-api" -> null
          - backend_address_pool_name  = "bar-api" -> null
          - backend_http_settings_id   = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/backendHttpSettingsCollection/bar-api" -> null
          - backend_http_settings_name = "bar-api" -> null
          - http_listener_id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/httpListeners/bar-api" -> null
          - http_listener_name         = "bar-api" -> null
          - id                         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/requestRoutingRules/bar-api" -> null
          - name                       = "bar-api" -> null
          - priority                   = 510 -> null
          - rule_type                  = "Basic" -> null
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/backendAddressPools/bulk-scan-orchestrator" -> null
          - backend_address_pool_name  = "bulk-scan-orchestrator" -> null
          - backend_http_settings_id   = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/backendHttpSettingsCollection/bulk-scan-orchestrator" -> null
          - backend_http_settings_name = "bulk-scan-orchestrator" -> null
          - http_listener_id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/httpListeners/bulk-scan-orchestrator" -> null
          - http_listener_name         = "bulk-scan-orchestrator" -> null
          - id                         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/requestRoutingRules/bulk-scan-orchestrator" -> null
          - name                       = "bulk-scan-orchestrator" -> null
          - priority                   = 10 -> null
          - rule_type                  = "Basic" -> null
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/backendAddressPools/bulk-scan-payment-processor" -> null
          - backend_address_pool_name  = "bulk-scan-payment-processor" -> null
          - backend_http_settings_id   = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/backendHttpSettingsCollection/bulk-scan-payment-processor" -> null
          - backend_http_settings_name = "bulk-scan-payment-processor" -> null
          - http_listener_id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/httpListeners/bulk-scan-payment-processor" -> null
          - http_listener_name         = "bulk-scan-payment-processor" -> null
          - id                         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/requestRoutingRules/bulk-scan-payment-processor" -> null
          - name                       = "bulk-scan-payment-processor" -> null
          - priority                   = 580 -> null
          - rule_type                  = "Basic" -> null
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/backendAddressPools/bulk-scan-processor" -> null
          - backend_address_pool_name  = "bulk-scan-processor" -> null
          - backend_http_settings_id   = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/backendHttpSettingsCollection/bulk-scan-processor" -> null
          - backend_http_settings_name = "bulk-scan-processor" -> null
          - http_listener_id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/httpListeners/bulk-scan-processor" -> null
          - http_listener_name         = "bulk-scan-processor" -> null
          - id                         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/requestRoutingRules/bulk-scan-processor" -> null
          - name                       = "bulk-scan-processor" -> null
          - priority                   = 240 -> null
          - rule_type                  = "Basic" -> null
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/backendAddressPools/bulk-scan-sample-app" -> null
          - backend_address_pool_name  = "bulk-scan-sample-app" -> null
          - backend_http_settings_id   = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/backendHttpSettingsCollection/bulk-scan-sample-app" -> null
          - backend_http_settings_name = "bulk-scan-sample-app" -> null
          - http_listener_id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/httpListeners/bulk-scan-sample-app" -> null
          - http_listener_name         = "bulk-scan-sample-app" -> null
          - id                         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/requestRoutingRules/bulk-scan-sample-app" -> null
          - name                       = "bulk-scan-sample-app" -> null
          - priority                   = 150 -> null
          - rule_type                  = "Basic" -> null
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/backendAddressPools/camunda-api" -> null
          - backend_address_pool_name  = "camunda-api" -> null
          - backend_http_settings_id   = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/backendHttpSettingsCollection/camunda-api" -> null
          - backend_http_settings_name = "camunda-api" -> null
          - http_listener_id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/httpListeners/camunda-api" -> null
          - http_listener_name         = "camunda-api" -> null
          - id                         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/requestRoutingRules/camunda-api" -> null
          - name                       = "camunda-api" -> null
          - priority                   = 650 -> null
          - rule_type                  = "Basic" -> null
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/backendAddressPools/camunda-optimize" -> null
          - backend_address_pool_name  = "camunda-optimize" -> null
          - backend_http_settings_id   = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/backendHttpSettingsCollection/camunda-optimize" -> null
          - backend_http_settings_name = "camunda-optimize" -> null
          - http_listener_id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/httpListeners/camunda-optimize" -> null
          - http_listener_name         = "camunda-optimize" -> null
          - id                         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/requestRoutingRules/camunda-optimize" -> null
          - name                       = "camunda-optimize" -> null
          - priority                   = 710 -> null
          - rule_type                  = "Basic" -> null
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/backendAddressPools/ccd-case-activity-api" -> null
          - backend_address_pool_name  = "ccd-case-activity-api" -> null
          - backend_http_settings_id   = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/backendHttpSettingsCollection/ccd-case-activity-api" -> null
          - backend_http_settings_name = "ccd-case-activity-api" -> null
          - http_listener_id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/httpListeners/ccd-case-activity-api" -> null
          - http_listener_name         = "ccd-case-activity-api" -> null
          - id                         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/requestRoutingRules/ccd-case-activity-api" -> null
          - name                       = "ccd-case-activity-api" -> null
          - priority                   = 160 -> null
          - rule_type                  = "Basic" -> null
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

s"
          + id                         = (known after apply)
          + name                       = "prl-cos"
          + priority                   = 50
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "prl-dgs"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "prl-dgs"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "prl-dgs"
          + id                         = (known after apply)
          + name                       = "prl-dgs"
          + priority                   = 60
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "rd-caseworker-ref-api"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "rd-caseworker-ref-api"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "rd-caseworker-ref-api"
          + id                         = (known after apply)
          + name                       = "rd-caseworker-ref-api"
          + priority                   = 210
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "rd-caseworker-ref-api-int"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "rd-caseworker-ref-api-int"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "rd-caseworker-ref-api-int"
          + id                         = (known after apply)
          + name                       = "rd-caseworker-ref-api-int"
          + priority                   = 280
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "rd-commondata-api"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "rd-commondata-api"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "rd-commondata-api"
          + id                         = (known after apply)
          + name                       = "rd-commondata-api"
          + priority                   = 310
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "rd-judicial-api"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "rd-judicial-api"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "rd-judicial-api"
          + id                         = (known after apply)
          + name                       = "rd-judicial-api"
          + priority                   = 220
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "rd-judicial-api-int"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "rd-judicial-api-int"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "rd-judicial-api-int"
          + id                         = (known after apply)
          + name                       = "rd-judicial-api-int"
          + priority                   = 290
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "rd-judicial-data-load"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "rd-judicial-data-load"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "rd-judicial-data-load"
          + id                         = (known after apply)
          + name                       = "rd-judicial-data-load"
          + priority                   = 230
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "rd-location-ref-api"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "rd-location-ref-api"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "rd-location-ref-api"
          + id                         = (known after apply)
          + name                       = "rd-location-ref-api"
          + priority                   = 240
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "rd-location-ref-api-int"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "rd-location-ref-api-int"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "rd-location-ref-api-int"
          + id                         = (known after apply)
          + name                       = "rd-location-ref-api-int"
          + priority                   = 300
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "rd-professional-api"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "rd-professional-api"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "rd-professional-api"
          + id                         = (known after apply)
          + name                       = "rd-professional-api"
          + priority                   = 180
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "rd-profile-sync"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "rd-profile-sync"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "rd-profile-sync"
          + id                         = (known after apply)
          + name                       = "rd-profile-sync"
          + priority                   = 200
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "rd-profile-sync-int"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "rd-profile-sync-int"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "rd-profile-sync-int"
          + id                         = (known after apply)
          + name                       = "rd-profile-sync-int"
          + priority                   = 260
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "rd-user-profile-api"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "rd-user-profile-api"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "rd-user-profile-api"
          + id                         = (known after apply)
          + name                       = "rd-user-profile-api"
          + priority                   = 190
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "rd-user-profile-api-int"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "rd-user-profile-api-int"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "rd-user-profile-api-int"
          + id                         = (known after apply)
          + name                       = "rd-user-profile-api-int"
          + priority                   = 270
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "sptribs-case-api"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "sptribs-case-api"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "sptribs-case-api"
          + id                         = (known after apply)
          + name                       = "sptribs-case-api"
          + priority                   = 480
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "sptribs-dss-backend"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "sptribs-dss-backend"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "sptribs-dss-backend"
          + id                         = (known after apply)
          + name                       = "sptribs-dss-backend"
          + priority                   = 490
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "sscs-hearings-api"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "sscs-hearings-api"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "sscs-hearings-api"
          + id                         = (known after apply)
          + name                       = "sscs-hearings-api"
          + priority                   = 350
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "ts-translation-service"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "ts-translation-service"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "ts-translation-service"
          + id                         = (known after apply)
          + name                       = "ts-translation-service"
          + priority                   = 420
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }

        # (157 unchanged blocks hidden)
    }

  # module.backendappgateway.azurerm_monitor_diagnostic_setting.diagnostic_settings[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {
        id                         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw|AppGw"
        name                       = "AppGw"
        # (2 unchanged attributes hidden)

      - log {
          - category = "ApplicationGatewayAccessLog" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "ApplicationGatewayFirewallLog" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "ApplicationGatewayPerformanceLog" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + metric {
          + category = (known after apply)
          + enabled  = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }
    }

  # module.backendappgateway.azurerm_monitor_diagnostic_setting.diagnostic_settings[1] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {
        id                         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw|AppGw"
        name                       = "AppGw"
        # (2 unchanged attributes hidden)

      - log {
          - category = "ApplicationGatewayAccessLog" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "ApplicationGatewayFirewallLog" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "ApplicationGatewayPerformanceLog" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + metric {
          + category = (known after apply)
          + enabled  = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }
    }

  # module.backendappgateway.azurerm_public_ip.app_gw[0] will be updated in-place
  ~ resource "azurerm_public_ip" "app_gw" {
      + ddos_protection_mode    = "VirtualNetworkInherited"
        id                      = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/publicIPAddresses/cft-aks-appgw-demo-pip"
        name                    = "cft-aks-appgw-demo-pip"
        tags                    = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "Medium"
            "environment"  = "demo"
        }
        # (10 unchanged attributes hidden)
    }

  # module.backendappgateway.azurerm_public_ip.app_gw[1] will be updated in-place
  ~ resource "azurerm_public_ip" "app_gw" {
      + ddos_protection_mode    = "VirtualNetworkInherited"
        id                      = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/publicIPAddresses/cft-aks-appgw-demo-pip-1"
        name                    = "cft-aks-appgw-demo-pip-1"
        tags                    = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "Medium"
            "environment"  = "demo"
        }
        # (10 unchanged attributes hidden)
    }

Plan: 0 to add, 6 to change, 0 to destroy.
```

</details>



<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.backendappgateway.azurerm_application_gateway.ag[0] has changed
  ~ resource "azurerm_application_gateway" "ag" {
      + fips_enabled                      = false
      + force_firewall_policy_association = false
        id                                = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw"
        name                              = "cft-aks00-demo-agw"
      + private_endpoint_connection       = []
        tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "Medium"
            "environment"  = "demo"
        }
        # (4 unchanged attributes hidden)

      ~ frontend_ip_configuration {
            id                            = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/frontendIPConfigurations/appGwPublicFrontendIp"
            name                          = "appGwPublicFrontendIp"
            # (2 unchanged attributes hidden)
        }
      ~ frontend_ip_configuration {
            id                            = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/frontendIPConfigurations/appGwPrivateFrontendIp"
            name                          = "appGwPrivateFrontendIp"
            # (3 unchanged attributes hidden)
        }

      + http_listener {
          + frontend_ip_configuration_id   = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/frontendIPConfigurations/appGwPrivateFrontendIp"
          + frontend_ip_configuration_name = "appGwPrivateFrontendIp"
          + frontend_port_id               = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/frontendPorts/http"
          + frontend_port_name             = "http"
          + host_name                      = "aac-manage-case-assignment-demo.service.core-compute-demo.internal"
          + host_names                     = []
          + id                             = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/httpListeners/aac-manage-case-assignment"
          + name                           = "aac-manage-case-assignment"
          + protocol                       = "Http"
          + require_sni                    = false
        }
      - http_listener {
          - frontend_ip_configuration_id   = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/frontendIPConfigurations/appGwPrivateFrontendIp" -> null
          - frontend_ip_configuration_name = "appGwPrivateFrontendIp" -> null
          - frontend_port_id               = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/frontendPorts/http" -> null
          - frontend_port_name             = "http" -> null
          - host_name                      = "aac-manage-case-assignment-demo.service.core-compute-demo.internal" -> null
          - host_names                     = [] -> null
          - id                             = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/httpListeners/aac-manage-case-assignment" -> null
          - name                           = "aac-manage-case-assignment" -> null
          - protocol                       = "Http" -> null
          - require_sni                    = false -> null
        }
      + http_listener {
          + frontend_ip_configuration_id   = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/frontendIPConfigurations/appGwPrivateFrontendIp"
          + frontend_ip_configuration_name = "appGwPrivateFrontendIp"
          + frontend_port_id               = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/frontendPorts/http"
          + frontend_port_name             = "http"
          + host_name                      = "am-judicial-booking-service-demo.service.core-compute-demo.internal"
          + host_names                     = []
          + id                             = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/httpListeners/am-judicial-booking-service"
          + name                           = "am-judicial-booking-service"
          + protocol                       = "Http"
          + require_sni                    = false
        }
      - http_listener {
          - frontend_ip_configuration_id   = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/frontendIPConfigurations/appGwPrivateFrontendIp" -> null
          - frontend_ip_configuration_name = "appGwPrivateFrontendIp" -> null
          - frontend_port_id               = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/frontendPorts/http" -> null
          - frontend_port_name             = "http" -> null
          - host_name                      = "am-judicial-booking-service-demo.service.core-compute-demo.internal" -> null
          - host_names                     = [] -> null
          - id                             = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/httpListeners/am-judicial-booking-service" -> null
          - name                           = "am-judicial-booking-service" -> null
          - protocol                       = "Http" -> null
          - require_sni                    = false -> null
        }
      + http_listener {
          + frontend_ip_configuration_id   = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/frontendIPConfigurations/appGwPrivateFrontendIp"
          + frontend_ip_configuration_name = "appGwPrivateFrontendIp"
          + frontend_port_id               = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/frontendPorts/http"
          + frontend_port_name             = "http"
          + host_name                      = "am-org-role-mapping-service-demo.service.core-compute-demo.internal"
          + host_names                     = []
          + id                             = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/httpListeners/am-org-role-mapping-service"
          + name                           = "am-org-role-mapping-service"
          + protocol                       = "Http"
          + require_sni                    = false
        }
      - http_listener {
          - frontend_ip_configuration_id   = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/frontendIPConfigurations/appGwPrivateFrontendIp" -> null
          - frontend_ip_configuration_name = "appGwPrivateFrontendIp" -> null
          - frontend_port_id               = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/frontendPorts/http" -> null
          - frontend_port_name             = "http" -> null
          - host_name                      = "am-org-role-mapping-service-demo.service.core-compute-demo.internal" -> null
          - host_names                     = [] -> null
          - id                             = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/httpListeners/am-org-role-mapping-service" -> null
          - name                           = "am-org-role-mapping-service" -> null
          - protocol                       = "Http" -> null
          - require_sni                    = false -> null
        }
      + http_listener {
          + frontend_ip_configuration_id   = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/frontendIPConfigurations/appGwPrivateFrontendIp"
          + frontend_ip_configuration_name = "appGwPrivateFrontendIp"
          + frontend_port_id               = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/frontendPorts/http"
          + frontend_port_name             = "http"
          + host_name                      = "am-role-assignment-service-demo.service.core-compute-demo.internal"
          + host_names                     = []
          + id                             = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/httpListeners/am-role-assignment-service"
          + name                           = "am-role-assignment-service"
          + protocol                       = "Http"
          + require_sni                    = false
        }
      - http_listener {
          - frontend_ip_configuration_id   = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/frontendIPConfigurations/appGwPrivateFrontendIp" -> null
          - frontend_ip_configuration_name = "appGwPrivateFrontendIp" -> null
          - frontend_port_id               = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/frontendPorts/http" -> null
          - frontend_port_name             = "http" -> null
          - host_name                      = "am-role-assignment-service-demo.service.core-compute-demo.internal" -> null
          - host_names                     = [] -> null
          - id                             = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/httpListeners/am-role-assignment-service" -> null
          - name                           = "am-role-assignment-service" -> null
          - protocol                       = "Http" -> null
          - require_sni                    = false -> null
        }
      + http_listener {
          + frontend_ip_configuration_id   = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/frontendIPConfigurations/appGwPrivateFrontendIp"
          + frontend_ip_configuration_name = "appGwPrivateFrontendIp"
          + frontend_port_id               = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/frontendPorts/http"
          + frontend_port_name             = "http"
          + host_name                      = "bar-api-demo.service.core-compute-demo.internal"
          + host_names                     = []
          + id                             = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/httpListeners/bar-api"
          + name                           = "bar-api"
          + protocol                       = "Http"
          + require_sni                    = false
        }
      - http_listener {
          - frontend_ip_configuration_id   = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/frontendIPConfigurations/appGwPrivateFrontendIp" -> null
          - frontend_ip_configuration_name = "appGwPrivateFrontendIp" -> null
          - frontend_port_id               = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/frontendPorts/http" -> null
          - frontend_port_name             = "http" -> null
          - host_name                      = "bar-api-demo.service.core-compute-demo.internal" -> null
          - host_names                     = [] -> null
          - id                             = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/httpListeners/bar-api" -> null
          - name                           = "bar-api" -> null
          - protocol                       = "Http" -> null
          - require_sni                    = false -> null
        }
      + http_listener {
          + frontend_ip_configuration_id   = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/frontendIPConfigurations/appGwPrivateFrontendIp"
          + frontend_ip_configuration_name = "appGwPrivateFrontendIp"
          + frontend_port_id               = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/frontendPorts/http"
          + frontend_port_name             = "http"
          + host_name                      = "bulk-scan-orchestrator-demo.service.core-compute-demo.internal"
          + host_names                     = []
          + id                             = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/httpListeners/bulk-scan-orchestrator"
          + name                           = "bulk-scan-orchestrator"
          + protocol                       = "Http"
          + require_sni                    = false
        }
      - http_listener {
          - frontend_ip_configuration_id   = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/frontendIPConfigurations/appGwPrivateFrontendIp" -> null
          - frontend_ip_configuration_name = "appGwPrivateFrontendIp" -> null
          - frontend_port_id               = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/frontendPorts/http" -> null
          - frontend_port_name             = "http" -> null
          - host_name                      = "bulk-scan-orchestrator-demo.service.core-compute-demo.internal" -> null
          - host_names                     = [] -> null
          - id                             = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/httpListeners/bulk-scan-orchestrator" -> null
          - name                           = "bulk-scan-orchestrator" -> null
          - protocol                       = "Http" -> null
          - require_sni                    = false -> null
        }
      + http_listener {
          + frontend_ip_configuration_id   = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/frontendIPConfigurations/appGwPrivateFrontendIp"
          + frontend_ip_configuration_name = "appGwPrivateFrontendIp"
          + frontend_port_id               = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/frontendPorts/http"
          + frontend_port_name             = "http"
          + host_name                      = "bulk-scan-payment-processor-demo.service.core-compute-demo.internal"
          + host_names                     = []
          + id                             = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/httpListeners/bulk-scan-payment-processor"
          + name                           = "bulk-scan-payment-processor"
          + protocol                       = "Http"
          + require_sni                    = false
        }
      - http_listener {
          - frontend_ip_configuration_id   = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/frontendIPConfigurations/appGwPrivateFrontendIp" -> null
          - frontend_ip_configuration_name = "appGwPrivateFrontendIp" -> null
          - frontend_port_id               = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/frontendPorts/http" -> null
          - frontend_port_name             = "http" -> null
          - host_name                      = "bulk-scan-payment-processor-demo.service.core-compute-demo.internal" -> null
          - host_names                     = [] -> null
          - id                             = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/httpListeners/bulk-scan-payment-processor" -> null
          - name                           = "bulk-scan-payment-processor" -> null
          - protocol                       = "Http" -> null
          - require_sni                    = false -> null
        }
      + http_listener {
          + frontend_ip_configuration_id   = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/frontendIPConfigurations/appGwPrivateFrontendIp"
          + frontend_ip_configuration_name = "appGwPrivateFrontendIp"
          + frontend_port_id               = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-demo-agw/frontendPorts/http"
          + frontend_port_name             = "http"
          + host_name                      = "bulk-scan-processor-demo.service.core-compute-demo.internal"
          + host_names                     = []
          + id                             = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGro

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/httpListeners/rd-profile-sync-int"
          + http_listener_name         = "rd-profile-sync-int"
          + id                         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/requestRoutingRules/rd-profile-sync-int"
          + name                       = "rd-profile-sync-int"
          + priority                   = 360
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/backendAddressPools/rd-profile-sync-int" -> null
          - backend_address_pool_name  = "rd-profile-sync-int" -> null
          - backend_http_settings_id   = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/backendHttpSettingsCollection/rd-profile-sync-int" -> null
          - backend_http_settings_name = "rd-profile-sync-int" -> null
          - http_listener_id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/httpListeners/rd-profile-sync-int" -> null
          - http_listener_name         = "rd-profile-sync-int" -> null
          - id                         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/requestRoutingRules/rd-profile-sync-int" -> null
          - name                       = "rd-profile-sync-int" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/backendAddressPools/rd-user-profile-api"
          + backend_address_pool_name  = "rd-user-profile-api"
          + backend_http_settings_id   = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/backendHttpSettingsCollection/rd-user-profile-api"
          + backend_http_settings_name = "rd-user-profile-api"
          + http_listener_id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/httpListeners/rd-user-profile-api"
          + http_listener_name         = "rd-user-profile-api"
          + id                         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/requestRoutingRules/rd-user-profile-api"
          + name                       = "rd-user-profile-api"
          + priority                   = 470
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/backendAddressPools/rd-user-profile-api" -> null
          - backend_address_pool_name  = "rd-user-profile-api" -> null
          - backend_http_settings_id   = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/backendHttpSettingsCollection/rd-user-profile-api" -> null
          - backend_http_settings_name = "rd-user-profile-api" -> null
          - http_listener_id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/httpListeners/rd-user-profile-api" -> null
          - http_listener_name         = "rd-user-profile-api" -> null
          - id                         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/requestRoutingRules/rd-user-profile-api" -> null
          - name                       = "rd-user-profile-api" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/backendAddressPools/rd-user-profile-api-int"
          + backend_address_pool_name  = "rd-user-profile-api-int"
          + backend_http_settings_id   = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/backendHttpSettingsCollection/rd-user-profile-api-int"
          + backend_http_settings_name = "rd-user-profile-api-int"
          + http_listener_id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/httpListeners/rd-user-profile-api-int"
          + http_listener_name         = "rd-user-profile-api-int"
          + id                         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/requestRoutingRules/rd-user-profile-api-int"
          + name                       = "rd-user-profile-api-int"
          + priority                   = 370
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/backendAddressPools/rd-user-profile-api-int" -> null
          - backend_address_pool_name  = "rd-user-profile-api-int" -> null
          - backend_http_settings_id   = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/backendHttpSettingsCollection/rd-user-profile-api-int" -> null
          - backend_http_settings_name = "rd-user-profile-api-int" -> null
          - http_listener_id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/httpListeners/rd-user-profile-api-int" -> null
          - http_listener_name         = "rd-user-profile-api-int" -> null
          - id                         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/requestRoutingRules/rd-user-profile-api-int" -> null
          - name                       = "rd-user-profile-api-int" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/backendAddressPools/sptribs-case-api"
          + backend_address_pool_name  = "sptribs-case-api"
          + backend_http_settings_id   = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/backendHttpSettingsCollection/sptribs-case-api"
          + backend_http_settings_name = "sptribs-case-api"
          + http_listener_id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/httpListeners/sptribs-case-api"
          + http_listener_name         = "sptribs-case-api"
          + id                         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/requestRoutingRules/sptribs-case-api"
          + name                       = "sptribs-case-api"
          + priority                   = 180
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/backendAddressPools/sptribs-case-api" -> null
          - backend_address_pool_name  = "sptribs-case-api" -> null
          - backend_http_settings_id   = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/backendHttpSettingsCollection/sptribs-case-api" -> null
          - backend_http_settings_name = "sptribs-case-api" -> null
          - http_listener_id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/httpListeners/sptribs-case-api" -> null
          - http_listener_name         = "sptribs-case-api" -> null
          - id                         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/requestRoutingRules/sptribs-case-api" -> null
          - name                       = "sptribs-case-api" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/backendAddressPools/sptribs-dss-backend"
          + backend_address_pool_name  = "sptribs-dss-backend"
          + backend_http_settings_id   = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/backendHttpSettingsCollection/sptribs-dss-backend"
          + backend_http_settings_name = "sptribs-dss-backend"
          + http_listener_id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/httpListeners/sptribs-dss-backend"
          + http_listener_name         = "sptribs-dss-backend"
          + id                         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/requestRoutingRules/sptribs-dss-backend"
          + name                       = "sptribs-dss-backend"
          + priority                   = 220
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/backendAddressPools/sptribs-dss-backend" -> null
          - backend_address_pool_name  = "sptribs-dss-backend" -> null
          - backend_http_settings_id   = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/backendHttpSettingsCollection/sptribs-dss-backend" -> null
          - backend_http_settings_name = "sptribs-dss-backend" -> null
          - http_listener_id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/httpListeners/sptribs-dss-backend" -> null
          - http_listener_name         = "sptribs-dss-backend" -> null
          - id                         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/requestRoutingRules/sptribs-dss-backend" -> null
          - name                       = "sptribs-dss-backend" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/backendAddressPools/sscs-hearings-api"
          + backend_address_pool_name  = "sscs-hearings-api"
          + backend_http_settings_id   = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/backendHttpSettingsCollection/sscs-hearings-api"
          + backend_http_settings_name = "sscs-hearings-api"
          + http_listener_id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/httpListeners/sscs-hearings-api"
          + http_listener_name         = "sscs-hearings-api"
          + id                         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/requestRoutingRules/sscs-hearings-api"
          + name                       = "sscs-hearings-api"
          + priority                   = 200
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/backendAddressPools/sscs-hearings-api" -> null
          - backend_address_pool_name  = "sscs-hearings-api" -> null
          - backend_http_settings_id   = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/backendHttpSettingsCollection/sscs-hearings-api" -> null
          - backend_http_settings_name = "sscs-hearings-api" -> null
          - http_listener_id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/httpListeners/sscs-hearings-api" -> null
          - http_listener_name         = "sscs-hearings-api" -> null
          - id                         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/requestRoutingRules/sscs-hearings-api" -> null
          - name                       = "sscs-hearings-api" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/backendAddressPools/ts-translation-service"
          + backend_address_pool_name  = "ts-translation-service"
          + backend_http_settings_id   = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/backendHttpSettingsCollection/ts-translation-service"
          + backend_http_settings_name = "ts-translation-service"
          + http_listener_id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/httpListeners/ts-translation-service"
          + http_listener_name         = "ts-translation-service"
          + id                         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/requestRoutingRules/ts-translation-service"
          + name                       = "ts-translation-service"
          + priority                   = 80
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/backendAddressPools/ts-translation-service" -> null
          - backend_address_pool_name  = "ts-translation-service" -> null
          - backend_http_settings_id   = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/backendHttpSettingsCollection/ts-translation-service" -> null
          - backend_http_settings_name = "ts-translation-service" -> null
          - http_listener_id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/httpListeners/ts-translation-service" -> null
          - http_listener_name         = "ts-translation-service" -> null
          - id                         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-demo-agw/requestRoutingRules/ts-translation-service" -> null
          - name                       = "ts-translation-service" -> null
          - rule_type                  = "Basic" -> null
        }

        # (155 unchanged blocks hidden)
    }

  # module.backendappgateway.azurerm_public_ip.app_gw[0] has changed
  ~ resource "azurerm_public_ip" "app_gw" {
        id                      = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/publicIPAddresses/cft-aks-appgw-demo-pip"
        name                    = "cft-aks-appgw-demo-pip"
      + sku_tier                = "Regional"
        tags                    = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "Medium"
            "environment"  = "demo"
        }
      ~ zones                   = [
          + "1",
          + "2",
          + "3",
        ]
        # (8 unchanged attributes hidden)
    }

  # module.backendappgateway.azurerm_public_ip.app_gw[1] has changed
  ~ resource "azurerm_public_ip" "app_gw" {
        id                      = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/publicIPAddresses/cft-aks-appgw-demo-pip-1"
        name                    = "cft-aks-appgw-demo-pip-1"
      + sku_tier                = "Regional"
        tags                    = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "Medium"
            "environment"  = "demo"
        }
      ~ zones                   = [
          + "1",
          + "2",
          + "3",
        ]
        # (8 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":1367,"Program":"tfcmt","SHA1":"","Target":"demo-backendappgateway","Vars":{}} -->